Revit 2017 API
Plane Constructor (XYZ, XYZ, XYZ)
 Constructs a Plane object from X and Y axes and an origin represented as XYZ objects. The plane passes through "origin" and is spanned by the basis vectors "xVec" and "yVec".
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2017. Please use Plane.CreateByOriginAndBasis() instead.")]
public Plane(
	XYZ xVec,
	XYZ yVec,
	XYZ origin
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2017. Please use Plane.CreateByOriginAndBasis() instead.")> _
Public Sub New ( _
	xVec As XYZ, _
	yVec As XYZ, _
	origin As XYZ _
)
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2017. Please use Plane.CreateByOriginAndBasis() instead.")]
public:
Plane(
	XYZ^ xVec,
	XYZ^ yVec,
	XYZ^ origin
)
Parameters
xVec
Type: Autodesk.Revit.DB.XYZ
 X axis of the resulting Plane object.
yVec
Type: Autodesk.Revit.DB.XYZ
 Y axis of the resulting Plane object.
origin
Type: Autodesk.Revit.DB.XYZ
 Origin of the resulting Plane object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Plane Class
Plane Overload
Autodesk.Revit.DB Namespace